// 整数数组的一个 排列 就是将其所有成员以序列或线性顺序排列。
//
//
// 例如，arr = [1,2,3] ，以下这些都可以视作 arr 的排列：[1,2,3]、[1,3,2]、[3,1,2]、[2,3,1] 。
//
//
// 整数数组的 下一个排列 是指其整数的下一个字典序更大的排列。更正式地，如果数组的所有排列根据其字典顺序从小到大排列在一个容器中，那么数组的 下一个排列 就
// 是在这个有序容器中排在它后面的那个排列。如果不存在下一个更大的排列，那么这个数组必须重排为字典序最小的排列（即，其元素按升序排列）。
//
//
// 例如，arr = [1,2,3] 的下一个排列是 [1,3,2] 。
// 类似地，arr = [2,3,1] 的下一个排列是 [3,1,2] 。
// 而 arr = [3,2,1] 的下一个排列是 [1,2,3] ，因为 [3,2,1] 不存在一个字典序更大的排列。
//
//
// 给你一个整数数组 nums ，找出 nums 的下一个排列。
//
// 必须 原地 修改，只允许使用额外常数空间。
//
//
//
// 示例 1：
//
//
// 输入：nums = [1,2,3]
// 输出：[1,3,2]
//
//
// 示例 2：
//
//
// 输入：nums = [3,2,1]
// 输出：[1,2,3]
//
//
// 示例 3：
//
//
// 输入：nums = [1,1,5]
// 输出：[1,5,1]
//
//
//
//
// 提示：
//
//
// 1 <= nums.length <= 100
// 0 <= nums[i] <= 100
//
//
// Related Topics 数组 双指针 👍 2941 👎 0

package p0031

// leetcode submit region begin(Prohibit modification and deletion)
// 找到下一个更大的排列
// nums 从右往左找到第一个下降的元素，然后向右找到比 idx 大的最小元素，然后交换彼此
// 注意没有找到，则证明已经是最大排列
// 然后右侧整体排序为由小到大（由于右侧是非递增则翻转右侧即可）
// 例子：1 2 7 4 3 1 -> 1 "3" 7 4 "2" 1 -> 1 3 1 2 4 7
func nextPermutation(nums []int) {
	idx := len(nums) - 2
	// 找到第一个下降的元素
	for ; idx >= 0; idx-- {
		if nums[idx] < nums[idx+1] {
			// 向右找到比 idx 大的最小元素，交换两者元素
			j := len(nums) - 1
			for ; nums[j] <= nums[idx]; j-- {
			}
			nums[idx], nums[j] = nums[j], nums[idx]
			break
		}
	}
	// 然后右侧整体排序为由小到大 -- 由于右侧是非递增则翻转右侧即可
	for i, j := idx+1, len(nums)-1; i < j; {
		nums[i], nums[j] = nums[j], nums[i]
		i++
		j--
	}
	return
}

// leetcode submit region end(Prohibit modification and deletion)
